
 [texto]   Utilizaremos abordagens parecidas com plotagem em R² se não está familiarizado com ela olhe <a href="{% url 'gnuplotdoiseixos' %}">plotar uma função em R²</a>, não veremos como suavizar ou deixar esse grafico mais "bonito" isso está na sessão avançada"
[/texto]

[titulo]Plotagem direta[/titulo]

[texto]
    Aqui com plotagem direta queremos dizer plotagem de uma função definita diretamente, mais a frente vamos aprender a gerar uma variavel e nessa variavel fazer a protagem 
[/texto]

[texto]dentro do GNUPLOT rode <br>

[/texto]

  
    [caixac]
    [texto]gnuplot> splot ~função~ [/texto]
    [/caixac]
  

por exemplo:


  
    [caixac]
    [texto]gnuplot> splot sin(x) [/texto]
    [/caixac]
  
(obs: tem q ser em ingles se for usar função senoidal)
[titulo]Resultado:[/titulo]
[img][site]/polls/static/assets/images/plotb311.png[/img] 

[texto]Claro como estamos em R³ podemos usar mais variaveis nesse grafico <br>

[/texto]
por exemplo:


  
    [caixac]
    [texto]gnuplot> splot sin(x*y) [/texto]
    [/caixac]
  
(obs: tem q ser em ingles se for usar função senoidal)
[titulo]Resultado:[/titulo]
[img][site]/polls/static/assets/images/plotb312.png[/img] 
[/texto]

[/texto]
esse grafico está claramente ruim, e deve ser melhorado mais a frente
[/texto]
[titulo]Ajeitando o grafico (basico)[/titulo]

[texto]
Os eixos X, Y e Z são ajeitados de maneira similar ao em R² usando <code>xrange</code> , <code>yrange</code> e <code>zrange</code>
  
[/texto]


  
    [caixac]
    [texto]gnuplot> set xrange[min:max]<br>
gnuplot> set yrange[min:max]<br>
gnuplot> set zrange[min:max] [/texto]
    [/caixac]
  


por exemplo:


  
    [caixac]
    [texto]gnuplot> set xrange[2:5]<br>
gnuplot> set yrange[2:5]<br>
gnuplot> set zrange[-5:5]<br>
gnuplot> gnuplot> splot sin(x*y) [/texto]
    [/caixac]
  
  
gera

[img][site]/polls/static/assets/images/plotb313.png[/img] 


perceba que esse grafico está muito mais bonito, por mais que ainda deva ter mudanças

[titulo]Definir funções[/titulo]

[texto]a definição de funções ocorre muito parecida com a em R², porem agora podemos utilizar sem definir explicitamente as variaveis x e y (obs: xy=/=x*y, xy não é entendido, pois xy é uma variavel nova, x*y é entendido como X vezes Y) [/texto]

  
    [caixac]
    gnuplot> gnuplot> f(x,y) = sin(x*y) 
    gnuplot> gnuplot> splot f(x,y) 
    [/caixac]
  


[img][site]/polls/static/assets/images/plotb314.png[/img] 

perceba que podemos utilizar funções como no caso de r²


  
    [caixac]
    gnuplot> gnuplot> f(x) = sin(x) 
    gnuplot> gnuplot> splot f(x) 
    [/caixac]
  


[img][site]/polls/static/assets/images/plotb315.png[/img] 


